{
  "html": "<p>Viber has confirmed a situation earlier this morning in which Viber appeared to have been hacked by the <a target=\"_blank\" href=\"http:\/\/en.wikipedia.org\/wiki\/Syrian_Electronic_Army\">Syrian Electronic Army<\/a> (a pro-government group of computer hackers aligned with Syrian President Bashar al-Assad).<\/p><p><a target=\"_blank\" href=\"http:\/\/www.applespot.nl\/48057\/viber-gehackt-door-sea-dienst-bespioneert-gebruikers\/\">AppleSpot<\/a> originally reported on the hack that affected the <a target=\"_blank\" href=\"http:\/\/support.viber.com\/\">Viber support page<\/a>, though it was unclear the extent to which hackers accessed Viber systems.<\/p><p><a href=\"http:\/\/techcrunch.com\/tag\/viber\/\">Viber<\/a> has now clarified that the hack only allowed access to two minor systems, a customer support panel and a support administration system. According to the company’s official response, “no sensitive user data was exposed and Viber’s databases were not ‘hacked’.”<\/p><p>The company did not confirm whether the attack came from the Syrian Electronic Army, though the hacker group does take responsibility for the hack. Viber did, however, claim that the hack was the product of a phishing attack that was carried out against one of their employees.<\/p><p>Here’s the official statement:<\/p><blockquote><p>Today the Viber Support site was defaced after a Viber employee unfortunately fell victim to an email phishing attack. The phishing attack allowed access to two minor systems: a customer support panel and a support administration system. Information from one of these systems was posted on the defaced page.<\/p><p>It is very important to emphasize that no sensitive user data was exposed and that Viber’s databases were not “hacked”. Sensitive, private user information is kept in a secure system that cannot be accessed through this type of attack and is not part of our support system.<\/p><p>We take this incident very seriously and we are working right now to return the support site to full service for our users. Additionally, we want to assure all of our users that we are reviewing all of our policies to make sure that no such incident is repeated in the future.<\/p><\/blockquote><p>The hack took down the Viber support page, and replaced it with the following message and a screenshot of the hack.<\/p><blockquote><p>Dear All Viber Users,<\/p><p>The Israeli-based “Viber” is spying and tracking you<\/p><p>We weren’t able to hack all Viber systems, but most of it is designed for spying and tracking<\/p><\/blockquote><p><img class=\"size-full wp-image-850037 aligncenter\" alt=\"viberhack\" src=\"http:\/\/tctechcrunch2011.files.wordpress.com\/2013\/07\/viberhack.jpg?w=522&amp;h=640\" width=\"522\" height=\"640\"><\/p><p><img class=\" wp-image-850040 aligncenter\" alt=\"viberhack2\" src=\"http:\/\/tctechcrunch2011.files.wordpress.com\/2013\/07\/viberhack2.jpg?w=640&amp;h=237\" width=\"640\" height=\"237\"><\/p><p>The above screenshot (within the screenshot) was meant to act as proof that the hackers did in fact access Viber’s databases. We also looked at their released files to confirm their claims (second screenshot).<\/p><p>As you can see, the hackers were able to access information such as phone number, UDID (a Viber-specific UDID, not the one Apple provides — see the update below), country, IP address, device type, OS OS type, OS version, registration date, most recent update, and push token. Viber has again iterated that this screenshot is of an admin dashboard, not a database. <\/p><p>Viber also took the opportunity to respond to accusations of spying:<\/p><blockquote><p>Viber, like many other companies such as Microsoft, Cisco, Google, and Intel maintains a development center in Israel. It seems like this caused some people to come up with some pretty bizarre conspiracy theories.<\/p><p>It goes without saying, that these claims are completely without merit, and have no basis in reality whatsoever.<\/p><\/blockquote><p><a target=\"_blank\" href=\"http:\/\/www.crunchbase.com\/company\/viber-media\">Viber<\/a> is a free messaging and calling service based out of London, with development centers in Israel, with over 200 million users globally.<\/p><p><strong>Update — Viber has followed up with more details on the data that was accessed:<\/strong><\/p><blockquote><p>The data is quite basic – we want to know when user registered, where from (country), device type (helps us understand who uses Viber, detect problems, etc), UDID is an internal ID (not the Apple UDID), push token is used to communicate with users (but cannot be used by a 3rd party), etc. While this is not the most sensitive data (message content, address book, etc), we are disappointed that hackers were able to gain access to these systems. We are working, as we speak, to make sure that this will not happen again. <\/p><p>The system that was breached is our CSR (Customer Support). Supporters need access to this data to help users with various technical issues. Most app developers would provide their supporters with similar data. <\/p><\/blockquote><p><em>We will continue to update this story as more information becomes available.<\/em><\/p>"
}